<a href="https://colab.research.google.com/github/ankit6102001/Python-Machine-learning-Deep-learning/blob/main/create_dataframe_from_csv_database_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv("d:/dataset/analysis/clothes.txt")
df

     size  price     brand
0   small     10       cob
1  medium     12     peter
2   large     15     monte
3   Small     11     monte
4  medium     10  cantabil
5  Medium     10       cob

In [ ]:
df=pd.read_csv("d:/dataset/analysis/clothes1.txt",sep=":")
df

     size  price     brand
0   small     10       cob
1  medium     12     peter
2   large     15     monte
3   small     11     monte
4  medium     10  cantabil
5  medium     10       cob

In [ ]:
df=pd.read_csv("d:/dataset/analysis/clothes2.txt",sep="\t")
df

     size  price     brand
0   small     10       cob
1  medium     12     peter
2   large     15     monte
3   small     11     monte
4  medium     10  cantabil
5  medium     10     monte

In [ ]:
list_dfs=pd.read_html("d:/dataset/analysis/test.html")

In [ ]:
len(list_dfs)

2

In [ ]:
df1=list_dfs[0]
df2=list_dfs[1]

In [ ]:
df1

   Name  Roll
0  Sonu  1001
1  Monu  1002

In [ ]:
df2

    Name  Salary
0   Ajay   10000
1  Vijay   20000

In [ ]:
from sqlalchemy import create_engine

In [ ]:
c=create_engine("mysql+pymysql://root:root@localhost/12pm")

In [ ]:
df=pd.read_sql("select * from emps",c)
df=pd.read_sql("select empid,empsal from emps",c)
df=pd.read_sql("select * from emps where empsal>50000",c)
df

    empid  empname  empsal
0     106      abc   50601
1     226     sonu   90101
2     306     sonu   90101
3    1000     sonu   90101
4    1001     sonu   90101
5    1002     sonu   90101
6    1003     sonu   90101
7    2000     sonu   90101
8    2001     ojas   90101
9    5001     raju   51101
10   5002     ramu   51101
11   6001  kuchbhi  544354

In [ ]:
df.to_excel("abc.xlsx",sheet_name='emp',index=False)

In [ ]:
df.to_csv("emp.txt",index=False)

In [ ]:
df=pd.read_csv("d:/dataset/analysis/clothes.txt")
df

     size  price     brand
0   small     10       cob
1  medium     12     peter
2   large     15     monte
3   Small     11     monte
4  medium     10  cantabil
5  Medium     10       cob

In [ ]:
df.to_sql("cloth",c)

In [ ]:
df=pd.read_csv("d:/dataset/analysis/restaurant.csv")
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
s=pd.Series([10,20,30,40])
print(s)
print(s.sum())

0    10
1    20
2    30
3    40
dtype: int64
100

In [ ]:
import numpy as np
a=np.array([10,20,30,40])
print(a)
print(a.sum())

[10 20 30 40]
100

In [ ]:
s1=df['total_bill']
s1=df.total_bill

In [ ]:
df.shape

(244, 7)

In [ ]:
df=pd.read_csv("d:/dataset/analysis/clothes.txt")
df

     size  price     brand
0   small     10       cob
1  medium     12     peter
2   large     15     monte
3   Small     11     monte
4  medium     10  cantabil
5  Medium     10       cob

In [ ]:
#df['price']
df.price

0    10
1    12
2    15
3    11
4    10
5    10
Name: price, dtype: int64

In [ ]:
df.size

18

In [ ]:
df['size']

0     small
1    medium
2     large
3     Small
4    medium
5    Medium
Name: size, dtype: object

In [ ]:
df=pd.read_csv("d:/dataset/analysis/restaurant.csv")
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
s=df.total_bill
s.sum()

4827.77

In [ ]:
df.total_bill.sum()

4827.77

In [ ]:
df.total_bill.mean()

19.785942622950824

In [ ]:
#df.gender.mean()

In [ ]:
df.total_bill.min()

3.07

In [ ]:
df.total_bill.max()

50.81

In [ ]:
df.total_bill.std()

8.902411954856856

In [ ]:
df.total_bill.median()

17.795